Aggressiveless/STM32F103C8T6/demo9-x 智能温控风扇系统/demo9-x1 串口发送温控信号+PWM占空比/Hardware/PWM.c
#include "stm32f10x.h"                  // Device header
#include "AD.h"

uint16_t ADValue;
float Temp;



void PWM_Init(void) 
{
	RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM2,ENABLE);
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA,ENABLE);
	
	GPIO_InitTypeDef GPIO_InitStructure;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_2;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_Init(GPIOA,&GPIO_InitStructure);
	
	TIM_InternalClockConfig(TIM2);
	
	TIM_TimeBaseInitTypeDef TIM_TimeBaseInitStructure;			
	TIM_TimeBaseInitStructure.TIM_ClockDivision = TIM_CKD_DIV1;		
	TIM_TimeBaseInitStructure.TIM_CounterMode = TIM_CounterMode_Up;	
	TIM_TimeBaseInitStructure.TIM_Period = 100 - 1;			//ARR	
	TIM_TimeBaseInitStructure.TIM_Prescaler = 36 - 1;			//psc	
	TIM_TimeBaseInitStructure.TIM_RepetitionCounter = 0;		
	TIM_TimeBaseInit(TIM2, &TIM_TimeBaseInitStructure);	
	
	TIM_OCInitTypeDef TIM_OCInitStructure;
	TIM_OCStructInit(&TIM_OCInitStructure);
	TIM_OCInitStructure.TIM_OCMode = TIM_OCMode_PWM1; 
	TIM_OCInitStructure.TIM_OCNPolarity = TIM_OCPolarity_High;
	TIM_OCInitStructure.TIM_OutputState = TIM_OutputState_Enable; 
	TIM_OCInitStructure.TIM_Pulse = 0;
	TIM_OC3Init(TIM2,&TIM_OCInitStructure);
	
	TIM_Cmd(TIM2, ENABLE);
}

void PWM_SetCompare3(uint16_t Compare)
{
	TIM_SetCompare3(TIM2,Compare);
}

float GetTemp(void)
{
	ADValue = AD_GetValue();
	Temp = (float)(4096 - ADValue) / 4095 * 100.0 - 28.0;
	return Temp;
}



